redd82/HaptiCap_V2_ESP32/src/main.cpp
// Loads the calibration data from a file
void IRAM_ATTR loadCalibrationData(fs::FS &fs, const char * path, CalData &caldata) {
  Serial.println(F("Loading calibration data..."));
  File file = fs.open(path, FILE_READ);
  delay(10);
  DeserializationError error = deserializeJson(calDataDoc, file);

  if (error){
    Serial.println(F("Failed to read file, using default calibration data."));
    Serial.println(error.c_str());
    saveCalibrationData(SPIFFS, path, caldata);
  }else{
  putJSONCalibrationDataInMemory();
  file.close();
  }
}

 void saveDebugSettingsToJSON() {
  debugSettingsDoc["debugHaptic"] = debugSettings.debugHaptic;
  debugSettingsDoc["debug2Serial"] = debugSettings.debug2Serial;
  debugSettingsDoc["debugData2Serial"] = debugSettings.debugData2Serial;  
  debugSettingsDoc["debug2Telnet"] = debugSettings.debug2Telnet;
}

// Saves the configuration to a file
void saveDebugSettings(fs::FS &fs, const char * path, const DebugSettings &debugSettings) {
  deleteFile(SPIFFS, path);
  Serial.println(path);
  File file = fs.open(path, FILE_WRITE);
  if (!file) {
    Serial.println(F("Failed to create file"));
    return;
  }
  saveDebugSettingsToJSON();
  if (serializeJson(debugSettingsDoc, file) == 0) {
    Serial.println(F("Failed to write to file"));
  }else{
    Serial.println(F("New file written"));
  }
  file.close();
}

void putJSONDebugSettingsInMemory() {
  debugSettings.debugHaptic = debugSettingsDoc["debugHaptic"].as<int>();  
  debugSettings.debug2Serial = debugSettingsDoc["debug2Serial"].as<int>();
  debugSettings.debugData2Serial = debugSettingsDoc["debugData2Serial"].as<int>(); 
  debugSettings.debug2Telnet = debugSettingsDoc["debug2Telnet"].as<int>(); 
}

// Loads the debug settings from a file
void IRAM_ATTR loadDebugSettings(fs::FS &fs, const char * path, DebugSettings &debugSettings) {
  Serial.println(F("Loading debug settings..."));
  File file = fs.open(path, FILE_READ);
  delay(10);
  DeserializationError error = deserializeJson(debugSettingsDoc, file);

  if (error){
    Serial.println(F("Failed to read file, using default debug settings."));
    Serial.println(error.c_str());
    saveDebugSettings(SPIFFS, path, debugSettings);
  }else{
  putJSONDebugSettingsInMemory();
  file.close();
  }
}

void printConfigInMemory(){
  Serial.print("As Accesspoint: ");
  Serial.println(config.asAP);
  Serial.print("Client to SSID: ");
  Serial.println(config.clientSSID);
  Serial.print("Client Password: ");
  Serial.println(config.clientPasswd);
  Serial.print("Connection Timeout: ");
  Serial.println(config.connectionTimeOut);
  Serial.print("Devicename: ");
  Serial.println(config.deviceName);
  Serial.print("Device password: ");
  Serial.println(config.apPasswd);
  Serial.print("GPS polling(s): ");
  Serial.println(config.gpsPollSec);
  Serial.print("Target reached: ");
  Serial.println(config.targetReached);
  Serial.print("Compass polling(ms): ");
  Serial.println(config.compPollMs);
  Serial.print("Compass offset(deg): ");
  Serial.println(config.compOffset);
  Serial.print("Homebase(lat): ");
  Serial.println(config.HOME_LAT,6);
  Serial.print("Homebase(lon):" );
  Serial.println(config.HOME_LON,6);
  Serial.print("Waypoint(lat): ");
  Serial.println(config.WAYPOINT_LAT,6);
  Serial.print("Waypoint(lon):" );
  Serial.println(config.WAYPOINT_LON,6);  
  Serial.print("Declanation angle(rads): ");
  Serial.println(config.declAngleRad,12);
  Serial.print("Sleeptime(mins): ");
  Serial.println(config.sleepMins);
  Serial.print("Threshold touch: ");
  Serial.println(config.touchThreshold);
  Serial.print("Enable touch: ");
  Serial.println(config.touchEnabled);
  Serial.print("Timezone offset: ");
  Serial.println(config.timeZoneOffset);
  Serial.print("Pulsed max distance: ");
  Serial.println(config.maxDistance);
  Serial.print("Max Delay between pulses: ");
  Serial.println(config.maxDelay);

  Serial.print("FTP Enabled: ");
  Serial.println(config.ftpEnabled);  
  bDumpConfig = 0;
  Serial.println(); 
}

void printCalDataInMemory(){
  Serial.print("magBiasX: ");
  Serial.println(caldata.magBiasX,6);
  Serial.print("magBiasY: ");
  Serial.println(caldata.magBiasY,6);
  Serial.print("magBiasZ: ");
  Serial.println(caldata.magBiasZ,6);
  Serial.print("magScaleFacX: ");
  Serial.println(caldata.magScaleFacX,6);
  Serial.print("magScaleFacY: ");
  Serial.println(caldata.magScaleFacY,6);
  Serial.print("magScaleFacZ: ");
  Serial.println(caldata.magScaleFacZ,6);
  Serial.print("gyroBiasX: ");
  Serial.println(caldata.gyroBiasX,6);
  Serial.print("gyroBiasY: ");
  Serial.println(caldata.gyroBiasY,6);
  Serial.print("gyroBiasZ: ");
  Serial.println(caldata.gyroBiasZ,6);
  Serial.print("accelBiasX: ");
  Serial.println(caldata.accelBiasX,6);
  Serial.print("accelBiasY: ");
  Serial.println(caldata.accelBiasY,6);
  Serial.print("accelBiasZ:" );
  Serial.println(caldata.accelBiasZ,6);
  Serial.print("accelScaleX: ");
  Serial.println(caldata.accelScaleX,6);
  Serial.print("accelScaleY:" );
  Serial.println(caldata.accelScaleY,6);  
  Serial.print("accelScaleZ: ");
  Serial.println(caldata.accelScaleZ,6);
  bDumpConfig = 0;
  Serial.println(); 
}

void printDebugSettingsInMemory(){
  Serial.print("Debug2Serial: ");
  Serial.println(debugSettings.debug2Serial);  
  Serial.print("Debug RAW GPS to telnet: ");
  Serial.println(debugSettings.debugData2Serial);
  Serial.print("Haptic feedback Debug: ");
  Serial.println(debugSettings.debugHaptic);
}

String GetGPSTime(){
      if (gps.time.isUpdated()){
        hours = gps.time.hour() + config.timeZoneOffset;
        mins = gps.time.minute();
        secs = gps.time.second();
      if(hours<10){
        GPSTime = "0" + String(hours);  
      }else{
         GPSTime = String(hours);  
        }
      if(mins<10){
        GPSTime = GPSTime + ":" + "0" + String(mins);
      }else{
        GPSTime = GPSTime + ":" + String(mins);
        }
      if(secs<10){
        GPSTime = GPSTime + ":" + "0" + String(secs);      
      }else{
        GPSTime = GPSTime + ":" + String(secs);
        }
      }
      return GPSTime;
}

unsigned long distance2waypoint(float waypoint_latt, float waypoint_long){ 
    unsigned long distanceToWaypoint = (unsigned long)TinyGPSPlus::distanceBetween(gps.location.lat(),gps.location.lng(),waypoint_latt,waypoint_long);
    return distanceToWaypoint;
}

float coarse2waypoint(float waypoint_latt, float waypoint_long){
    float coarseToWaypoint = TinyGPSPlus::courseTo(gps.location.lat(),gps.location.lng(),waypoint_latt,waypoint_long);
    //const char *cardinalToWaypoint = TinyGPSPlus::cardinal(coarseToWaypoint);
    return coarseToWaypoint;
}

float CalcRelHeading(float compforheading,float coarseforWaypoint){
    float relativeHeading;
    if (coarseforWaypoint > compforheading){   
      relativeHeading = coarseforWaypoint - compforheading;
    }
    else{
      relativeHeading = 360.0 - compforheading + coarseforWaypoint;
    }
    return relativeHeading;
}

// Printline functions
static void printFloat(float val, bool valid, int len, int prec){
  if (!valid){
    while (len-- > 1)
      Serial.print('*');
    Serial.print(' ');
  }
  else{
    Serial.print(val, prec);
    int vi = abs((int)val);
    int flen = prec + (val < 0.0 ? 2 : 1); // . and -
    flen += vi >= 1000 ? 4 : vi >= 100 ? 3 : vi >= 10 ? 2 : 1;
    for (int i=flen; i<len; ++i)
      Serial.print(' ');
  }
  smartDelay(0);
}

